{
  "Home": {
    "title": "JavaScript開発者",
    "subtitle": "",
    "contents": {
      "s1": "お会いできて嬉しいです。\n\n情報とビジネスに関するお問い合わせは、",
      "s2": "そして、もしあなたが好むなら、",
      "s3": "\n\nご連絡をお待ちしております。"
    }
  },
  "Write": {
    "title": "執筆",
    "subtitle": "論文とソフトウェアのコレクション",
    "contents": {
      "s1": "",
      "papers": [
        {
          "title": "狭いスペースでのかくれんぼの技術: Tinyseed",
          "subtitle": "2023年12月14日",
          "pinned": false,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/tinyseed",
          "date": "2023年12月",
          "official_tinyseed_url": {
            "label": "tinyseed.io",
            "link": "https://tinyseed.io"
          },
          "warning": "このサイトからデータが外部に出ることは絶対にありません。すべてのデータはあなたのマシン上にあり、処理後は直ちに削除されます。",
          "buttons": {
            "read_more": "続きを読む",
            "close": "閉じる",
            "words": "単語",
            "indexes": "インデックス"
          },
          "pre_content": "デジタル実装の",
          "content": ", Tinyseedはあなたのウォレットのシードフレーズやシャミールの秘密分割をバックアップすることができます。ビットコイン、イーサリアム、およびNFTを紛失から保護します。",
          "sub_content": "このページを印刷（Ctrl+Pまたは⌘ Command+P）して安全に保管してください。",
          "choose_proposal": "提案の中から一つを選んでください:",
          "parts": {
            "use": "使用",
            "instead": "代わりに"
          }
        },
        {
          "title": "ウサギの穴を越えた自由を求めて: 論文I",
          "subtitle": "2023年9月15日\n最終更新日: 2024年4月30日",
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/thesis-i",
          "date": "2023年9月",
          "warning": "開発段階",
          "incomplete": "未完成",
          "incomplete_content": "全文を解除するには、以下の単語に署名してください:",
          "signature": "署名",
          "verify": "確認",
          "notification": {
            "title": "申し訳ありません:(",
            "content": "このページにはまだ実行中の機能がありません。"
          }
        },
        {
          "title": "ウサギの穴に飛び込む: コンピュータサイエンスの視点",
          "subtitle": "2023年9月12日",
          "pinned": false,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/perspective-of-computer-science",
          "date": "2023年9月",
          "warning": "警告: これらのメモには、講義の文脈でのコンピュータサイエンスに関する意見、個人的な経験、および極端な視点が含まれています。いかなる当事者を軽蔑したり侮辱することを意図したものではありません。さらなる考慮なしに完全に消化しないでください。「続きを読む」を押すことで、理解したと見なされます。",
          "buttons": {
            "read_more": "続きを読む",
            "close": "閉じる"
          },
          "content": "教育の世界で高い成績やGPAがすべてではないと感じたことはありますか？このメモには私の見解が含まれており、おそらく非常に異なるかもしれません。もしかしたら、あなたはそれに反論するかもしれません。私はあなたに私の意見や見解に同意を強制するつもりはありません。私の原則は、ただ高い成績やGPAを追いかけるのではなく、自己理解と発展を優先することです。私の教育背景は、自然科学（科学）を専攻した高校卒業生です。\n\n何か面白いことから始めましょう。学期末に、教授が強調して言いました、「プログラマーやソフトウェア開発者になるために情報学の学生である必要はありません。」私は彼の意見に完全に同意しましたが、他の学生のほとんどはその言葉を聞いてショックを受けました。もし大学の混乱と疲労の中で学期末にそのような声明を聞いたら、どのように感じますか？情報学専攻を選んだことを後悔しますか？ハハ、私は個人的には後悔しません。教授の意見に同意します。なぜなら、彼の議論を聞いたとき、私はJavaScriptプログラミング言語だけを使用した1つのソフトウェアプロジェクトから約6000万IDR（約3900ドル）を稼いだことを証明しました（プロジェクトは今でも稼働しており、生産的です）。参考までに、私のキャンパスではJavaScriptは全く教えられていません。\n\n今、なぜ私がGPAをあまり重視しないのか理解できたかもしれません。私にとって、成績はただの紙の上の落書きであり、目標の邪魔になる単なる認識です。高い成績を持つことが優れたスキルを持つことを意味すると信じていません。成績は実際の行動と責任によって証明されるべきだと思います。\n\nもしかしたら、学業成績があまり良くなくてもコンピュータサイエンスでどうやって生産的になれるのか疑問に思っているかもしれません。私が答える前に、大学に入学したときの目標を考えてみてください。大学に行くのは本当にお金のためだけですか？学位が良い仕事に就く唯一の道だと思いますか？私の答えは、成績を無視して、まず財政面に集中することを選ぶことです。それは成績が不要という意味ではありません。単にそれを脇に置くだけです。\n\nこの決定を軽率に下したわけではありません。成績を信じない特定の理由があります。あなたは私を狂っているとか愚かだとか呼ぶかもしれませんし、私のGPAが平均以下であることを考えれば、議論するつもりはありません。私は心配しています。多くの人が高い成績を持っているのに実社会で苦労しているからです。これは実際には私の問題ではありませんが、高い成績が必ずしも実践的なスキルを持つことを意味しないため、心配しています。\n\nまた驚くべきことを聞きたいですか？私の教授は「セミナーを受ける学生の90％はすべてめちゃくちゃだ」と言いながらも彼らは合格するのです。さらに、私より高い成績を持つクラスメートの論文を手伝うためのオファーをいくつか受けました。オファーのうちいくつかはお金を提供するため受け入れました。成績や単なる認識ではありません。\n\nそうであれば、どの視点から成績を信じるべきでしょうか？",
          "resolution": {
            "title": "解決策: コンピュータサイエンスを独学または情報学の学士レベルで掘り下げたい場合に考慮すべきこと。",
            "content": "心配しないでください。職業学校を卒業していない場合や自然科学（科学）を専攻していない場合でも、インターネット（自分で勉強するか、講義に出席せずに）を使ってコンピュータサイエンスの専門家になることができると確信しています。私も最初にコンピュータサイエンスの世界に入ったときは全く無知でした。そして、数学が怖かった一つの理由でした。JavaScriptも例外ではありません。\n\n大学が唯一の就職の道だとは考えないでください。外には学位を持たないが、子供に良い教育を提供できる多くの人々がいます。彼らが何を使って子供の教育を資金提供していると思いますか？葉っぱですか？自己改善と評判を築くために学びましょう。学位を持てば、仕事の地位が上がり、より高い給料を得ることができます。しかし、得た名前とタイトルに対する責任も持つ必要があります。\n\n独学の学習アプローチで本当に専門家になることができます。この道を選ぶ場合、大学は必要（追加）となりますが、別の道を選ぶ場合、大学は必要（主要）になるかもしれません。専門知識の他に、独学の道を取る場合は広いネットワークやつながりも非常に重要です。実際、最終的には大学に行っても、自主学習能力を大幅に発展させることが求められますが、講師からの指導と方向性があります。\n\n大学に入ると、決められたカリキュラムに従うことになります。さまざまな科目に遭遇するでしょう。その中には私の見解では選択科目とみなされるものもあります。あなたの目標によります。あなたが直面する科目は、プログラミングアルゴリズム、ソフトウェア工学、微積分学、人工知能、デザイン、ソフトウェアテストなど、さまざまな分野を含んでいます。\n\nなぜ選択的なのか？私の見解では、すべての科目をマスターしようとすることは過度かもしれませんが、それができることに害はありません。私のアドバイスは、すべての科目で最高の成績を取るために努力する代わりに（最終的に役に立たないため忘れられる）、目標を達成するために集中することです。無関係な科目では十分な成績を取り、将来のキャリア目標に関連するレッスンを最大限に活用してください。\n\n各講師にはそれぞれの専門分野があることを覚えておいてください。大学に行ったとき、数学の講師が数学とコンピュータサイエンス（プログラム）の関係を直接実装して説明することはないでしょう。また、プログラミングを教える講師が前の講師の数学的知識を直接プログラムに適用することもまれです。すべては自己開発の責任であり、目標を達成するために戻ります。将来の仕事には複雑な数学の理解が必要ですか？そうでなければ、数学の理解を過度に高める必要はありません。\n\nなぜすべての科目をマスターしようとするのですか？アバターになりたいのですか？私はこれを時間の無駄だと考えています。ボクサーがパイロットのように飛べる必要はなく、その逆も同様です。\n\nつまり、大学や特定の科目が重要でないという意味ではありません。後で大学に入ったときに自分で感じるかもしれません。「専攻」と呼ばれるものの、私は全く集中しているとは思いません。むしろ広範囲に及んでいます。多くの科目が選択肢（各科目は異なる職業につながる可能性があります）ですが、全体的に良い成績を期待されています。特定の情熱や目標を見つけた場合、これは障害になるかもしれません。すべての職業をマスターすることは可能ですか？\n\nこれらのメモは、時間とエネルギーを無駄にしないように、事前に適切な準備を計画するのに役立ちます。はい、誠実に学べば科学には無駄がないことを完全に理解しています。\n\n最終的に、成績（GPA）や大学、すべてが個々のニーズと目標に合った場合には価値と関連性があります。能力があるなら、大学に行って成績に注意を払うことに害はありませんが、私の意見に同意するなら、目標に関連のない科目では適切な成績を取得し、目標に関連のある科目では高い成績を取得することに集中してください（繰り返しを避けて）。\n\n最悪の場合、私と同じような状況を経験し、卒業が遅れたとしても、悲しまないでください。最終的に卒業するときには、仕事の経験と飛行時間が十分で、良い仕事を見つけることができます。特に、学業中にコンピュータサイエンス自体から安定した収入を得ている場合、何を心配する必要がありますか？学業成績？ハハ。\n\n卒業を目指して成績を追い求めるのではなく、責任を持てる成績を求めましょう。卒業後に学んだことと一致しない分野で働かないでください。それはお金、時間、エネルギーの無駄です。"
          }
        },
        {
          "title": "赤いバラの咲く: 序文",
          "subtitle": "2023年2月24日\n最終更新日: 2024年5月20日",
          "pinned": true,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/an-introduction",
          "date": "2023年2月",
          "social_links": {
            "github": "https://github.com/rvnrstnsyh",
            "gitlab": "https://gitlab.com/rvnrstnsyh",
            "docker": "https://hub.docker.com/u/rvnrstnsyh",
            "linkedin": "https://linkedin.com/in/rvnrstnsyh"
          },
          "about": {
            "me": {
              "title": "私について？",
              "content": "ソフトウェアを書いています。メインの言語はJavaScriptです。"
            },
            "site": {
              "title": "このサイトについて？",
              "content": "開発は2023年2月/3月に始まりました。これは私の書かれた作品と作成したソフトウェアを収容するためのプラットフォームです。クライアント側のみを対象としたNext.js 14を利用して、このサイトはできるだけシンプルに設計されています。デフォルトのNGINXページに触発されました。現在、このサイトのいくつかのページだけが、プロキシを通じて「Unknown BE」と呼ばれるサーバーと通信しています。\n\nこのサイトは公共利用に安全であるように設計されていることを保証します。"
            },
            "darknet": {
              "title": "隠しサービス（TOR）",
              "content": "このサイトはダークネットにもオンラインであり、JavaScriptを有効にしてアクセスできます",
              "url": "http://unicorn465jakmpxhawaumyujt52wess5qhal6ng3dcm32uprpzy33qd.onion",
              "label": "ここ"
            }
          }
        }
      ]
    },
    "components": {
      "pinned": "ピン留めされた",
      "latest": "最新",
      "oldest": "最古"
    }
  },
  "BuyMeACoffee": {
    "title": "コーヒーを買ってください",
    "subtitle": "最終更新日: 2024年5月20日",
    "contents": {
      "s1": "すべての",
      "s2": "EVM互換ネットワーク"
    },
    "components": {}
  }
}
