{
  "Home": {
    "title": "JavaScript Developer",
    "subtitle": "",
    "contents": {
      "s1": "Рад видеть вас.\n\nДля получения информации и деловых запросов, пожалуйста, обратитесь к",
      "s2": "и если вы предпочитаете",
      "s3": "\n\nС нетерпением жду вашего ответа."
    }
  },
  "Write": {
    "title": "Написать",
    "subtitle": "Коллекция документов и программного обеспечения",
    "contents": {
      "s1": "",
      "papers": [
        {
          "title": "Искусство пряток в маленьких пространствах: Tinyseed",
          "subtitle": "14 декабря 2023 г.",
          "pinned": false,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/tinyseed",
          "date": "Дек 2023",
          "official_tinyseed_url": {
            "label": "tinyseed.io",
            "link": "https://tinyseed.io"
          },
          "warning": "Данные совершенно не покидают этот сайт. Все находится на вашем устройстве, все данные в очереди немедленно удаляются после обработки.",
          "buttons": {
            "read_more": "Читать далее",
            "close": "Закрыть",
            "words": "слова",
            "indexes": "индексы"
          },
          "pre_content": "Цифровая реализация",
          "content": ", Tinyseed позволяет вам создать резервную копию seed-фразы или секретных долей Шамира вашего кошелька. Он позволяет защитить Биткойн, Эфириум и NFT от потери.",
          "sub_content": "Вы можете распечатать эту страницу (Ctrl+P или ⌘ Command+P) и сохранить ее в безопасности.",
          "choose_proposal": "Выберите одно из предложений:",
          "parts": {
            "use": "использовать",
            "instead": "вместо"
          }
        },
        {
          "title": "В поисках свободы за пределами кроличьей норы: Тезис I",
          "subtitle": "15 сентября 2023 г.\nПоследнее обновление: 30 апреля 2024 г.",
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/thesis-i",
          "date": "Сен 2023",
          "warning": "На стадии разработки",
          "incomplete": "Не завершено",
          "incomplete_content": "Чтобы разблокировать весь документ, подпишите слова ниже:",
          "signature": "Подпись",
          "verify": "Проверить",
          "notification": {
            "title": "Извините :(",
            "content": "Эта страница пока не имеет работающей функции."
          }
        },
        {
          "title": "Погружение в кроличью нору: Перспектива компьютерных наук",
          "subtitle": "12 сентября 2023 г.",
          "pinned": false,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/perspective-of-computer-science",
          "date": "Сен 2023",
          "warning": "Предупреждение: Эти заметки содержат мнения, личный опыт и экстремальные точки зрения о компьютерных науках в контексте лекций. Не предназначено для унижения или оскорбления любой стороны; пожалуйста, не воспринимайте их полностью без дальнейших размышлений. Нажимая \"Читать далее\", вы соглашаетесь с этими условиями.",
          "buttons": {
            "read_more": "Читать далее",
            "close": "Закрыть"
          },
          "content": "Чувствовали ли вы когда-нибудь, что высокие оценки или GPA не все в мире образования? Эта заметка содержит мои взгляды, которые могут сильно отличаться, возможно, вы даже будете спорить с ними. Я не прошу ничего, кроме как заставлять вас соглашаться с моим мнением или взглядами; мой принцип - приоритизировать саморазвитие и понимание, а не просто гоняться за высокими оценками или GPA. Мое образовательное прошлое - выпускник средней школы с уклоном в естественные науки (наука).\n\nДавайте начнем с чего-то интересного. В конце семестра мой профессор твердо заявил: \"Вам не нужно быть студентом информатики, чтобы стать программистом или разработчиком программного обеспечения.\" Я полностью согласился с его взглядами, в то время как большинство других студентов были шокированы этим заявлением. Как бы вы себя чувствовали, если бы в разгар путаницы и усталости от учебы в университете вы услышали такое заявление в конце семестра? Пожалеете ли вы о выборе специальности информатики? Ха-ха, я лично не сожалею. Я согласен с преподавателем, просто потому, что, услышав его аргумент, я доказал это, заработав около шестидесяти миллионов IDR или около $3900 на одном проекте программного обеспечения, который использует только язык программирования JavaScript (проект все еще работает и продуктивен по сей день ). Для дополнительной информации, мой университет вообще не учит JavaScript.\n\nТеперь, возможно, вы понимаете, почему я не особо приоритизирую GPA. Для меня оценки - это просто каракули на бумаге и признание, которое мешает моим целям. Я не верю, что наличие высоких оценок означает наличие отличных навыков. Я верю, что оценки должны быть доказаны через реальные действия и ответственность.\n\nВозможно, вы спрашиваете, как я могу быть продуктивным через компьютерные науки с не самым лучшим академическим послужным списком? Прежде чем я отвечу, подумайте о своих целях при поступлении в университет. Правда ли, что вы идете в университет только ради денег? Думаете ли вы, что степень - это единственный путь к хорошей работе? Мой ответ - выбрать игнорирование оценок и сосредоточиться на финансовом аспекте в первую очередь. Это не значит, что мне не нужны оценки; я просто ставлю их на задний план.\n\nЯ не принял это решение легкомысленно. У меня есть конкретная причина, почему я не верю в оценки. Вы можете назвать меня сумасшедшим или глупым, и я не буду спорить, учитывая, что мой GPA ниже среднего. Я беспокоюсь, потому что многие имеют высокие оценки, но испытывают трудности в реальном мире. Хотя это, в общем-то, не мое дело, я беспокоюсь, потому что высокие оценки не всегда означают наличие практических навыков.\n\nХотите услышать что-то еще удивительное? Мой профессор сказал, что \"90% студентов, посещающих семинары, все запутались\" и все же они сдают. Я также получил несколько предложений помочь однокурсникам, которые имели более высокие оценки, чем я, в завершении их диссертаций; только некоторые предложения я принимаю, потому что они предлагают деньги, а не оценки или простое признание.\n\nЕсли так, с какой перспективы я должен верить в оценки?",
          "resolution": {
            "title": "Разрешение: Вещи, которые нужно учитывать, если вы хотите углубиться в компьютерные науки на самоучке или на уровне бакалавриата в информатике.",
            "content": "Не волнуйтесь, даже если вы не закончили профессиональное училище или не специализировались в естественных науках (науке). Я уверен, что вы можете стать профессионалом в области компьютерных наук, просто используя интернет (учась самостоятельно или не посещая лекции). Я тоже был полностью слеп, когда впервые попал в мир компьютерных наук, и одной из моих страхов была математика, даже JavaScript не исключение.\n\nНе предполагайте, что университет - это единственный путь к получению работы. В мире много людей, у которых нет академических степеней, но которые могут дать хорошее образование своим детям. Как вы думаете, что они используют для финансирования образования своих детей? лист? Учитесь, чтобы улучшить себя и создать репутацию. Со степенью ваша должность на работе может повышаться, и вы можете получать более высокую зарплату. Однако, помните, что вы также должны быть ответственны за имя и титул, который вы получите.\n\nВы действительно можете стать экспертом с независимым (самостоятельным) подходом к обучению. Если вы выбираете этот путь, университет станет необходимостью (дополнительной), а если вы выбираете другой маршрут, университет может стать более сосредоточенным на необходимости (основной). Помимо знаний, наличие широкой сети или связей также очень важно, если вы выберете путь самоучки. На самом деле, в конце концов, когда вы будете в университете, вам все равно потребуется значительно развивать свои независимые навыки обучения, но с руководством и направлением от преподавателей.\n\nПосле поступления в университет вы будете следовать предопределенной учебной программе. Вы столкнетесь с различными предметами, некоторые из которых могут считаться необязательными, на мой взгляд, в зависимости от ваших устремлений. Предметы, с которыми вы столкнетесь, охватывают различные области, от программирования алгоритмов, инженерии программного обеспечения, исчисления, искусственного интеллекта, дизайна до тестирования программного обеспечения.\n\nПочему это необязательно? На мой взгляд, пытаться освоить все предметы может быть слишком много, но нет ничего плохого в том, чтобы суметь это сделать. Мой совет - вместо того чтобы усердно пытаться достичь самых высоких оценок по всем предметам, которые в конечном итоге забываются (потому что они бесполезны в рабочем мире), лучше сосредоточьтесь на достижении своих целей. Ищите достаточные оценки по нерелевантным предметам и максимизируйте уроки, которые актуальны для ваших будущих карьерных целей.\n\nЗаметьте, что каждый преподаватель также имеет свою область экспертизы. Я уверен, что, когда вы поступите в университет, вы не увидите, как преподаватели математики непосредственно применяют и объясняют связь между математикой и компьютерными науками (программами). Кроме того, редко бывает, чтобы преподаватели, которые учат программированию, применяли математические знания от предыдущих преподавателей непосредственно в программу, которую они учат вас. Все это ваша ответственность в саморазвитии, и возвращается к достижению ваших целей. Потребуется ли в вашей будущей работе понимание сложной математики? Если нет, вам не нужно переусердствовать в максимизации вашего понимания математики.\n\nПочему вы должны стараться усердно освоить все предметы? Хотите ли вы быть аватаром? Я считаю это пустой тратой времени. Помните, боксеру не требуется уметь летать, как пилот, и наоборот.\n\nИтак, что я имею в виду, это не думать, что университет и определенные предметы не важны. Возможно, вы почувствуете это сами позже, когда поступите в университет. Хотя это называется \"Специальностью\", я вовсе не считаю это сосредоточенным или специфическим, скорее широким и обширным. Там много предметов, которые являются необязательными (каждый предмет может привести к разным профессиям), но от вас ожидается, что вы получите хорошие оценки в целом. Это может быть препятствием, если вы нашли определенную страсть или цель. Возможно ли освоить все профессии?\n\nЭти заметки помогут вам спланировать подготовку, которая соответствует вашим достижениям заранее, чтобы не было пустой траты времени и энергии. Да, я полностью понимаю, что в науке ничего не пропадает даром, если мы изучаем ее искренне.\n\nВ конце концов, будь то оценки (GPA) или университет, все имеет ценность и релевантность, если соответствует нуждам и целям каждого человека. Если вы способны, нет ничего плохого в том, чтобы поступить в университет и все же уделять внимание оценкам, но если вы согласны с моим мнением, попытайтесь получить адекватные оценки по нерелевантным предметам (избегая повторения). Сосредоточьтесь больше на развитии своих навыков и достижении карьерных целей в будущем, и постарайтесь добиться высоких оценок по предметам, которые актуальны для вашей профессии.\n\nВ худшей ситуации, если вы испытываете что-то подобное мне и даже оканчиваете поздно, не грустите. Когда вы наконец-то окончите, ваш рабочий опыт и часы налета будут достаточны, чтобы найти хорошую работу. Особенно если вы уже смогли получать стабильный доход во время учебы от самой компьютерной науки, о чем вам беспокоиться? Академические оценки? Ха-ха.\n\nНе ищите оценки только с целью завершения учебы, но ищите оценки, за которые вы можете быть ответственны. Не позволяйте себе работать в области, которая не соответствует тому, что вы изучали во время учебы, после окончания; это пустая трата денег, времени и энергии."
          }
        },
        {
          "title": "Расцветающие красные розы: Введение",
          "subtitle": "24 февраля 2023 г.\nПоследнее обновление: 20 мая 2024 г.",
          "pinned": true,
          "noprint": {
            "title": false,
            "subtitle": false
          },
          "path": "/write/an-introduction",
          "date": "Фев 2023",
          "social_links": {
            "github": "https://github.com/rvnrstnsyh",
            "gitlab": "https://gitlab.com/rvnrstnsyh",
            "docker": "https://hub.docker.com/u/rvnrstnsyh",
            "linkedin": "https://linkedin.com/in/rvnrstnsyh"
          },
          "about": {
            "me": {
              "title": "Обо мне?",
              "content": "Я пишу программное обеспечение, JavaScript - основной язык."
            },
            "site": {
              "title": "Об этом сайте?",
              "content": "Разработка началась в феврале/марте 2023 года. Это моя платформа для размещения письменных работ и программного обеспечения, которое я создаю. Используя Next.js 14, который я создал специально для клиентской стороны, этот сайт разработан как можно проще, вдохновленный страницей по умолчанию NGINX. В настоящее время только несколько страниц на этом сайте общаются с сервером, называемым 'Неизвестный BE' через прокси.\n\nЯ убеждаюсь, что этот сайт безопасен по замыслу для публичного использования."
            },
            "darknet": {
              "title": "Скрытая служба (TOR)",
              "content": "Этот сайт также доступен в даркнете, вы можете получить к нему доступ с включенным JavaScript",
              "url": "http://unicorn465jakmpxhawaumyujt52wess5qhal6ng3dcm32uprpzy33qd.onion",
              "label": "здесь"
            }
          }
        }
      ]
    },
    "components": {
      "pinned": "Закреплено",
      "latest": "Новейшее",
      "oldest": "Старейшее"
    }
  },
  "BuyMeACoffee": {
    "title": "Купите мне кофе",
    "subtitle": "Последнее обновление: 20 мая 2024 г.",
    "contents": {
      "s1": "Все на всех",
      "s2": "EVM-совместимых сетях"
    },
    "components": {}
  }
}
